var app = {};
var chartDom = document.getElementById('main');
var myChart = echarts.init(chartDom);
var option;

option = {
    legend: {},
    tooltip: {},
    dataset: {
        source: [
            ['product', '投篮命中率%：', '投篮命中', '投篮出手','三分命中率%：', '三分命中', '三分出手','罚球命中率%：', '罚球命中', '罚球出手'],
            ['雄鹿',48.5, 44.5, 91.7, 39.5, 14.8 ,37.4 ,75.8, 15.8 ,20.8],
            ['篮网',49.3, 43.2, 87.6 ,38.8 ,14.1, 36.2, 80.5 ,18.2, 22.6],
            ['爵士',46.6 ,41.1 ,88.3 ,39.0 ,16.0 ,43.3, 79.4 ,17.3 ,21.8 ],
            ['掘金', 48.8 ,43.5, 89.2, 38.3, 13.1, 34.2 ,79.4, 15.3, 19.3],
            ['鹈鹕',48.2 ,42.6 ,88.4 ,34.9 ,10.7 ,30.6 ,73.4 ,19,1 ,26.0 ],
            ['奇才',48.3 ,42.1, 87.1 ,41.9, 14.4 ,34.4, 83.4, 16.3 ,19.5 ],
            ['快船', 48.2, 42.8, 88.7, 36., 12.1 ,33.2 ,74.0, 16.9, 22.9],
            ['国王',47.0 ,42.1, 89.7, 34.9, 10.4 ,29.9 ,75.9, 19.6, 25.9],
            ['开拓者',44., 40.6 ,90.8, 37.7, 15.7 ,41.7, 82.3, 17.5 ,21.3 ],
            ['太阳',48.7, 43.0 ,88.3, 37.4 ,13.0 ,34.8, 82.8 ,15.2 ,18.3
]
        ]
    },
    xAxis: {type: 'category'},
    yAxis: {},
    // Declare several bar series, each will be mapped
    // to a column of dataset.source by default.
    series: [
        {type: 'bar'},
        {type: 'bar'},
        {type: 'bar'}
    ]
};

option && myChart.setOption(option);
